[
  {"text": "Every day you stay committed is a victory. You're stronger than any craving.", "category": "general"},
  {"text": "The discomfort you feel today is building the freedom you'll enjoy tomorrow.", "category": "general"},
  {"text": "You didn't come this far to only come this far. Keep going.", "category": "general"},
  {"text": "Your future self is thanking you for the choices you make today.", "category": "general"},
  {"text": "Progress, not perfection. Every smoke-free moment counts.", "category": "smoking"},
  {"text": "Your lungs are healing right now. Every breath is easier than before.", "category": "smoking"},
  {"text": "The craving will pass whether you smoke or not. Choose not to.", "category": "smoking"},
  {"text": "You're not giving up smoking. You're gaining your health, money, and freedom back.", "category": "smoking"},
  {"text": "Each cigarette you don't smoke is money saved and years added to your life.", "category": "smoking"},
  {"text": "Cigarettes never solved a single problem. They only created new ones.", "category": "smoking"},
  {"text": "Sobriety isn't about deprivation. It's about clarity and presence.", "category": "alcohol"},
  {"text": "You don't need alcohol to relax, celebrate, or cope. You have everything you need within you.", "category": "alcohol"},
  {"text": "Waking up clear-headed is a gift you give yourself every day you don't drink.", "category": "alcohol"},
  {"text": "The temporary escape isn't worth the lasting regret. Stay present.", "category": "alcohol"},
  {"text": "Real confidence doesn't come from a bottle. It comes from facing life head-on.", "category": "alcohol"},
  {"text": "Every sober day is proof that you're stronger than you thought.", "category": "alcohol"},
  {"text": "Life has so much more to offer than pixels on a screen. Go find it.", "category": "gaming"},
  {"text": "The achievements that matter most can't be unlocked in a game.", "category": "gaming"},
  {"text": "Time is your most valuable resource. Invest it in your real life.", "category": "gaming"},
  {"text": "The real world has better graphics and the rewards actually matter.", "category": "gaming"},
  {"text": "Gaming is an escape. But what you're running from will still be there. Face it instead.", "category": "gaming"},
  {"text": "Your skills and focus can build something real. Don't waste them on virtual points.", "category": "gaming"},
  {"text": "Discipline is choosing between what you want now and what you want most.", "category": "general"},
  {"text": "You are not your habits. You are the one who can change them.", "category": "general"},
  {"text": "Small daily improvements lead to stunning long-term results.", "category": "general"},
  {"text": "The best time to start was yesterday. The second best time is now.", "category": "general"},
  {"text": "Your brain is rewiring itself every day you resist. Trust the process.", "category": "general"},
  {"text": "Discomfort is temporary. The pride of overcoming lasts forever.", "category": "general"},
  {"text": "You're breaking chains that have held you for too long. Keep pulling.", "category": "general"},
  {"text": "Replace the habit with something better. Fill the void with purpose.", "category": "general"}
]
